; 主引导程序
section mbr vstart=0x7c00  ; vstart=0x7c00，则nasm编译到这句话的时候会让cs为0x7c00
    ; 设置寄存器
    mov ax, cs
    mov ds, ax
    mov es, ax
    mov ss, ax
    mov fs, ax
    mov sp, 0x7c00
    mov ax, 0xb800
    mov gs, ax


    ;清屏 利用0x06号功能，上卷全部行，则可清屏。
    ;------------------------------------------------------
    ;INT 0x10   功能号:0x06	   功能描述:上卷窗口
    ;------------------------------------------------------
    ;输入：
    ;AH 功能号= 0x06
    ;AL = 上卷的行数(如果为0,表示全部)
    ;BH = 上卷行属性
    ;(CL,CH) = 窗口左上角的(X,Y)位置
    ;(DL,DH) = 窗口右下角的(X,Y)位置
    ;无返回值：
    mov ah, 0x06
    mov al, 0
    mov cl, 0
    mov ch, 0
    mov dl, 79
    mov dh, 24
    int 0x10

    ;;;;;;;;;    下面这三行代码是获取光标位置    ;;;;;;;;;
    ;清屏 利用0x03号功能，上卷全部行，则可清屏。
    ;------------------------------------------------------
    ;INT 0x10   功能号:0x03	   功能描述:上卷窗口
    ;------------------------------------------------------
    ;输入：
    ;AH 功能号= 0x03
    ;BH = 获取光标的行号
    ;输出：
    ;ch = 光标开始行
    ;cl = 光标结束行
    ;dh = 光标所在行号
    ;dl = 光标所在列号
    mov ah, 3
    mov bh, 0
    int 0x10
    ;;;;;;;;;;;;;;    获取光标位置结束    ;;;;;;;;;;;;;;;;


    ;;;;;;;;;     打印字符串    ;;;;;;;;;;;
    ;直接写显存
    mov byte [gs:0x00], '1'
    mov byte [gs:0x01], 0b1010_0100
    mov byte [gs:0x02], ' '
    mov byte [gs:0x03], 0b1010_0100
    mov byte [gs:0x04], 'M'
    mov byte [gs:0x05], 0b1010_0100
    mov byte [gs:0x06], 'B'
    mov byte [gs:0x07], 0b1010_0100
    mov byte [gs:0x08], 'R'
    mov byte [gs:0x09], 0b1010_0100
    ;;;;;;;;;      打字字符串结束	 ;;;;;;;;;;;;;;;

end: jmp end ; 使程序悬停在此

message db "1 MBR"
message_end:

times 510 - ($ - $$) db 0
    db 0x55, 0xaa

